# Python Para Data-Science & Data-Analytics

In [1]:
# Importação das Bibliotecas
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()
%matplotlib inline

In [2]:
# Lendo a Base de Dados do Titanic
df = pd.read_csv('dados/train.csv')

In [3]:
# 5 Primeiras linhas
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
# 5 Ultimas Linhas
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [5]:
# Trazendo 5 Linhas Aleatorios do Dataframe
df.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
464,465,0,3,"Maisner, Mr. Simon",male,NaN,0,0,A/S 2816,8.05,NaN,S
434,435,0,1,"Silvey, Mr. William Baird",male,50.0,1,0,13507,55.90,E44,S
249,250,0,2,"Carter, Rev. Ernest Courtenay",male,54.0,1,0,244252,26.00,NaN,S
752,753,0,3,"Vande Velde, Mr. Johannes Joseph",male,33.0,0,0,345780,9.50,NaN,S
655,656,0,2,"Hickman, Mr. Leonard Mark",male,24.0,2,0,S.O.C. 14879,73.50,NaN,S

In [6]:
# Informações dos dados e tipo dos dados
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
# Descrição estatistica dos dados, campos numericos
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [8]:
# Resumo Estatistico dos campos categoricos
df.describe(include='O')

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

In [9]:
# Resumo Estatistico dos Campos categoricos
df.describe(include='object')

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

## Renomeando Tabelas

In [10]:
# Colunas
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [11]:
# Renomeando e Traduzindo do Ingles para o Portugues
df.columns = ['IdPassageiro', 'Sobreviveu', 'Classe', 'Nome', 'Sexo', 'Idade',
               'IrmaosConjuge', 'PaisFilhos', 'Bilhete', 'Tarifa', 'Cabine', 'Embarque']
df.head()

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [12]:
# Tipos dos Dados
df.dtypes

IdPassageiro       int64
Sobreviveu         int64
Classe             int64
Nome              object
Sexo              object
Idade            float64
IrmaosConjuge      int64
PaisFilhos         int64
Bilhete           object
Tarifa           float64
Cabine            object
Embarque          object
dtype: object

In [13]:
# Selecionando Apenas Colunas Especificas
df[['Nome', 'Sexo', 'Cabine', 'Tarifa']]

                                                  Nome    Sexo Cabine   Tarifa
0                              Braund, Mr. Owen Harris    male    NaN   7.2500
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female    C85  71.2833
2                               Heikkinen, Miss. Laina  female    NaN   7.9250
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female   C123  53.1000
4                             Allen, Mr. William Henry    male    NaN   8.0500
..                                                 ...     ...    ...      ...
886                              Montvila, Rev. Juozas    male    NaN  13.0000
887                       Graham, Miss. Margaret Edith  female    B42  30.0000
888           Johnston, Miss. Catherine Helen "Carrie"  female    NaN  23.4500
889                              Behr, Mr. Karl Howell    male   C148  30.0000
890                                Dooley, Mr. Patrick    male    NaN   7.7500

[891 rows x 4 columns]

In [14]:
# Selecionando Apenas 1 coluna
df['Sexo'].head()

#OBS: Quando Seleciona apenas com [] vira como DataSeries

0      male
1    female
2    female
3    female
4      male
Name: Sexo, dtype: object

In [15]:
# Selecionando Apenas 1 Coluna
df[['Sexo']].head()

#OBS: Quando Seleciono com [[]] vira como DataFrame

     Sexo
0    male
1  female
2  female
3  female
4    male

## Funçoes Matematicas

In [16]:
# Media
df['Idade'].mean()

29.69911764705882

In [17]:
# Soma
df.Idade.sum()

21205.17

In [18]:
# Contagem
df['Idade'].count()

714

In [19]:
# Mediana
df.Idade.median()

28.0

In [20]:
# Moda
df['Idade'].mode()

0    24.0
Name: Idade, dtype: float64

In [21]:
# Maior
df['Idade'].max()

80.0

In [22]:
# Menor
df['Idade'].min()

0.42

In [23]:
# Indice de Maior Idade
df['Idade'].idxmax()

630

In [24]:
# Indice de Menor Idade
df['Idade'].idxmin()

803

In [25]:
# Indice de Mais de 1 coluna
df[['Idade', 'Classe']].idxmin()

Idade     803
Classe      1
dtype: int64

## Utilizando o Loc e iLoc

### Utilisando o iLoc

In [26]:
# Selecionando Pelo Index - iloc
df.iloc[630]

IdPassageiro                                      631
Sobreviveu                                          1
Classe                                              1
Nome             Barkworth, Mr. Algernon Henry Wilson
Sexo                                             male
Idade                                            80.0
IrmaosConjuge                                       0
PaisFilhos                                          0
Bilhete                                         27042
Tarifa                                           30.0
Cabine                                            A23
Embarque                                            S
Name: 630, dtype: object

In [27]:
# Selecionando como DataFrame
df.iloc[[456, 123, 678]]

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
456,457,0,1,"Millet, Mr. Francis Davis",male,65.0,0,0,13509,26.55,E38,S
123,124,1,2,"Webber, Miss. Susan",female,32.5,0,0,27267,13.00,E101,S
678,679,0,3,"Goodwin, Mrs. Frederick (Augusta Tyler)",female,43.0,1,6,CA 2144,46.90,NaN,S

In [28]:
# Selecionando os 5 primeiros
df.iloc[:5]

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Utilizando o Loc

In [29]:
# Trazando  varias colunas
df[['Idade', 'Sexo', 'Tarifa', 'Classe', 'Sobreviveu']].loc[df['Sexo'] == 'male'].head()

# Localize para mim das seguintes colunas... Onde o Sexo seja = a 'male' e mostre apenas as 5 primeiras linhas

   Idade  Sexo   Tarifa  Classe  Sobreviveu
0   22.0  male   7.2500       3           0
4   35.0  male   8.0500       3           0
5    NaN  male   8.4583       3           0
6   54.0  male  51.8625       1           0
7    2.0  male  21.0750       3           0

In [30]:
# Localize para mim das seguintes colunas... Onde o Sexo seja = a 'female' e mostre apenas as 5 primeiras linhas
df[['Idade', 'Sexo', 'Tarifa', 'Classe', 'Sobreviveu']].loc[df['Sexo'] == 'female'].head()

   Idade    Sexo   Tarifa  Classe  Sobreviveu
1   38.0  female  71.2833       1           1
2   26.0  female   7.9250       3           1
3   35.0  female  53.1000       1           1
8   27.0  female  11.1333       3           1
9   14.0  female  30.0708       2           1

In [31]:
# Localize para mim das seguintes colunas.. Onde a Idade seja maior que 50 e mostre apenas 5 primeiras linhas
df[['Idade', 'Sexo', 'Tarifa', 'Classe', 'Sobreviveu']].loc[df['Idade'] > 50].head()

    Idade    Sexo   Tarifa  Classe  Sobreviveu
6    54.0    male  51.8625       1           0
11   58.0  female  26.5500       1           1
15   55.0  female  16.0000       2           1
33   66.0    male  10.5000       2           0
54   65.0    male  61.9792       1           0

In [32]:
# Localize para mim das seguintes colunas.. As Crianças entre 3 e 10 anos de idade, mostre as 7 primeiras linhas
df[['Idade', 'Sexo', 'Tarifa', 'Classe', 'Sobreviveu']]\
                .loc[(df['Idade'] >= 3) &
                    (df['Idade'] <= 10)].head(7)

     Idade    Sexo   Tarifa  Classe  Sobreviveu
10     4.0  female  16.7000       3           1
24     8.0  female  21.0750       3           0
43     3.0  female  41.5792       2           1
50     7.0    male  39.6875       3           0
58     5.0  female  27.7500       2           1
63     4.0    male  27.9000       3           0
147    9.0  female  34.3750       3           0

In [33]:
# Localize para mim das seguintes colunas.. Crianças entre 3 a 10 anos apenas as que sobreviveram, mostre as 7 primeiras linhas
df[['Idade', 'Sexo', 'Tarifa', 'Classe', 'Sobreviveu']]\
                .loc[(df['Idade'] >= 3) & (df['Idade'] <= 10) & (df['Sobreviveu'] == 1)].head(7)

     Idade    Sexo   Tarifa  Classe  Sobreviveu
10     4.0  female  16.7000       3           1
43     3.0  female  41.5792       2           1
58     5.0  female  27.7500       2           1
165    9.0    male  20.5250       3           1
184    4.0  female  22.0250       3           1
193    3.0    male  26.0000       2           1
233    5.0  female  31.3875       3           1

In [34]:
# Localize para mim das seguintes colunas.. 
# Crianças entre 3 a 10 anos apenas as que NÃO sobreviveram, mostre as 7 primeiras linhas
df[['Idade', 'Sexo', 'Tarifa', 'Classe', 'Sobreviveu']]\
                .loc[(df['Idade'] >= 3) & (df['Idade'] <= 10) & (df['Sobreviveu'] == 0)].head(7)

     Idade    Sexo   Tarifa  Classe  Sobreviveu
24     8.0  female  21.0750       3           0
50     7.0    male  39.6875       3           0
63     4.0    male  27.9000       3           0
147    9.0  female  34.3750       3           0
171    4.0    male  29.1250       3           0
182    9.0    male  31.3875       3           0
278    7.0    male  29.1250       3           0

In [35]:
# Localize para mim das seguintes colunas.. Apenas pessoas que tenham acima de 18 anos
df[['Idade', 'Sexo', 'Classe']].loc[(df['Idade'] > 18)].head(10)

    Idade    Sexo  Classe
0    22.0    male       3
1    38.0  female       1
2    26.0  female       3
3    35.0  female       1
4    35.0    male       3
6    54.0    male       1
8    27.0  female       3
11   58.0  female       1
12   20.0    male       3
13   39.0    male       3

In [36]:
# Localiza Pessoas Acima de 20 Anos que não sobreviveram
df[['Sexo', 'Idade', 'Classe']]\
    .loc[(df['Idade'] <= 20) &
        (df['Sobreviveu'] == 1) &
        (df['Classe'] == 3)].head(7)

       Sexo  Idade  Classe
10   female    4.0       3
22   female   15.0       3
39   female   14.0       3
44   female   19.0       3
68   female   17.0       3
125    male   12.0       3
156  female   16.0       3

## Map e Replace

In [37]:
# Renomeando os Nomes da Coluna Sexo
df['Sexo'].map({'male':'homen', 'female':'mulher'}).head(7)

0     homen
1    mulher
2    mulher
3    mulher
4     homen
5     homen
6     homen
Name: Sexo, dtype: object

In [38]:
# Outra Maneira de Renomear
df['Sexo'].replace({'male':'homen', 'female':'mulher'}).head(7)

0     homen
1    mulher
2    mulher
3    mulher
4     homen
5     homen
6     homen
Name: Sexo, dtype: object

In [39]:
# Outra Maneira Utilizando Listas
df['Sexo'].replace(['male', 'female'], ['homen', 'mulher'], inplace=True)
df['Sexo'].head(7)

0     homen
1    mulher
2    mulher
3    mulher
4     homen
5     homen
6     homen
Name: Sexo, dtype: object

## GroupBy = Agrupa Por!

In [40]:
# Agrupando pela soma da idade
df.groupby('Idade').sum().head()

       IdPassageiro  Sobreviveu  Classe  IrmaosConjuge  PaisFilhos    Tarifa
Idade
0.42            804           1       3              0           1    8.5167
0.67            756           1       2              1           1   14.5000
0.75           1115           2       6              4           2   38.5166
0.83            911           2       4              1           3   47.7500
0.92            306           1       1              1           2  151.5500

In [41]:
# Agrupando pela media das idade
df.groupby('Idade').mean().head()

       IdPassageiro  Sobreviveu  Classe  IrmaosConjuge  PaisFilhos    Tarifa
Idade
0.42          804.0         1.0     3.0            0.0         1.0    8.5167
0.67          756.0         1.0     2.0            1.0         1.0   14.5000
0.75          557.5         1.0     3.0            2.0         1.0   19.2583
0.83          455.5         1.0     2.0            0.5         1.5   23.8750
0.92          306.0         1.0     1.0            1.0         2.0  151.5500

In [42]:
# Agrupando Pela Media da Classe
df.groupby('Classe').mean()

,IdPassageiro,Sobreviveu,Idade,IrmaosConjuge,PaisFilhos,Tarifa
Classe,,,,,,
1,461.597222,0.629630,38.233441,0.416667,0.356481,84.154687
2,445.956522,0.472826,29.877630,0.402174,0.380435,20.662183
3,439.154786,0.242363,25.140620,0.615071,0.393075,13.675550

## Crosstab - Tabela Cruzada

In [43]:
pd.crosstab(df['Sobreviveu'], df['Classe']).style.background_gradient(cmap='Dark2')

In [44]:
pd.crosstab(df['Sobreviveu'], df['Sexo']).style.background_gradient(cmap='Blues')

In [45]:
# Ordenando os Dados do maior Para o Menor
df[['Idade', 'Sexo', 'Classe', 'Sobreviveu']].sort_values('Classe', ascending=True).head(7)

     Idade    Sexo  Classe  Sobreviveu
445   4.00   homen       1           1
310  24.00  mulher       1           1
309  30.00  mulher       1           1
307  17.00  mulher       1           1
306    NaN  mulher       1           1
305   0.92   homen       1           1
710  24.00  mulher       1           1

In [46]:
# Ordenando os Dados do Menor Para o Maior
df[['Idade', 'Sexo', 'Classe', 'Sobreviveu']].sort_values('Classe', ascending=False).head(7)

     Idade    Sexo  Classe  Sobreviveu
0     22.0   homen       3           0
511    NaN   homen       3           0
500   17.0   homen       3           0
501   21.0  mulher       3           0
502    NaN  mulher       3           0
503   37.0  mulher       3           0
508   28.0   homen       3           0

## Dados Faltantes

In [47]:
# Analisando se Temos Dados Nulos
df.isnull().any()

IdPassageiro     False
Sobreviveu       False
Classe           False
Nome             False
Sexo             False
Idade             True
IrmaosConjuge    False
PaisFilhos       False
Bilhete          False
Tarifa           False
Cabine            True
Embarque          True
dtype: bool

In [48]:
# Analisando os Dados Nulos e a quantidade de nulos
df.isnull().sum()

IdPassageiro       0
Sobreviveu         0
Classe             0
Nome               0
Sexo               0
Idade            177
IrmaosConjuge      0
PaisFilhos         0
Bilhete            0
Tarifa             0
Cabine           687
Embarque           2
dtype: int64

In [49]:
# Analisando apenas a coluna Embarque
df.loc[df['Embarque'].isnull()]

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
61,62,1,1,"Icard, Miss. Amelie",mulher,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",mulher,62.0,0,0,113572,80.0,B28,NaN

In [50]:
# Valores Unicos da coluna embarque
df['Embarque'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [51]:
# Moda de Embarque
df['Embarque'].mode()

0    S
Name: Embarque, dtype: object

In [52]:
# Substituindo os Dados Nulos
df['Embarque'].fillna('S', inplace=True)

In [53]:
# Analise dos Dados Nulos de Embarque
df.loc[df['Embarque'].isnull()]

Empty DataFrame
Columns: [IdPassageiro, Sobreviveu, Classe, Nome, Sexo, Idade, IrmaosConjuge, PaisFilhos, Bilhete, Tarifa, Cabine, Embarque]
Index: []

In [54]:
# Caso minha opção fosse substituir ou atribuir valores aos dados nulos
df['Embarque'].at[61] = 'C'
df['Embarque'].at[829] = 'S'

## Deletando Linhas e Colunas

In [55]:
# Analisando Dados Nulos
df.isnull().sum()

IdPassageiro       0
Sobreviveu         0
Classe             0
Nome               0
Sexo               0
Idade            177
IrmaosConjuge      0
PaisFilhos         0
Bilhete            0
Tarifa             0
Cabine           687
Embarque           0
dtype: int64

In [56]:
# axis = 1 Coluna
# axis = 0 Linha
df.drop('Cabine', axis=1, inplace=True)

In [57]:
df.head(2)

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Embarque
0,1,0,3,"Braund, Mr. Owen Harris",homen,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",mulher,38.0,1,0,PC 17599,71.2833,C

In [58]:
# Para Deleta linhas
df.drop([4, 5, 6, 7, 9]).head()

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Embarque
0,1,0,3,"Braund, Mr. Owen Harris",homen,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",mulher,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",mulher,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",mulher,35.0,1,0,113803,53.1000,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",mulher,27.0,0,2,347742,11.1333,S

In [59]:
# Analise dos Dados Nulos Novamente
df.isnull().sum()

IdPassageiro       0
Sobreviveu         0
Classe             0
Nome               0
Sexo               0
Idade            177
IrmaosConjuge      0
PaisFilhos         0
Bilhete            0
Tarifa             0
Embarque           0
dtype: int64

## Aply e Lambda

In [60]:
# Vamos Analisa os dados nulos de Idade
df['Idade'].isnull().sum()

177

In [61]:
# Analise dos Dados Unicos de Idade
df.Idade.unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [62]:
# Analisando a Media a Mediana e a Moda de Idade
print(f'Media: {df.Idade.mean()}')
print(f'Mediana: {df.Idade.median()}')
print(f'Moda: {df.Idade.mode()}')

Media: 29.69911764705882
Mediana: 28.0
Moda: 0    24.0
Name: Idade, dtype: float64

**Como a Media, Mediana e Moda estao bem proximas, não utilizaremos para tratamentos dos dados**

In [63]:
# Substituindo os Dados Nulos pelo o anterior não nulo
df['Idade'].fillna(method='bfill', limit=2, inplace=True)
df.Idade.isnull().sum()

5

In [64]:
# Analisando Todos os Dados Nulos
df.isnull().sum()

IdPassageiro     0
Sobreviveu       0
Classe           0
Nome             0
Sexo             0
Idade            5
IrmaosConjuge    0
PaisFilhos       0
Bilhete          0
Tarifa           0
Embarque         0
dtype: int64

In [65]:
# Iremos analisa agora a coluna Bilhete
df[['Bilhete']].head(7)

            Bilhete
0         A/5 21171
1          PC 17599
2  STON/O2. 3101282
3            113803
4            373450
5            330877
6             17463

In [67]:
# Usando Engenharia de Recursos Para Analisa a coluna bilhete
# Aplicando uma função Lambda para remover uma letra do bilhete
df['Bilhete'] = df['Bilhete'].apply(lambda x: x[:-1])
df[['Bilhete']].head(7)

           Bilhete
0         A/5 2117
1          PC 1759
2  STON/O2. 310128
3            11380
4            37345
5            33087
6             1746

## Variaveis Dummy HotEncoder

In [68]:
pd.get_dummies(df, columns=['Sexo']).head()

,IdPassageiro,Sobreviveu,Classe,Nome,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Embarque,Sexo_homen,Sexo_mulher
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 2117,7.2500,S,1,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 1759,71.2833,C,0,1
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 310128,7.9250,S,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,11380,53.1000,S,0,1
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,37345,8.0500,S,1,0

In [69]:
# Deixando Apenas uma coluna Mulher ou homen
df = pd.get_dummies(df, columns=['Sexo'], drop_first=True)
df.head()

,IdPassageiro,Sobreviveu,Classe,Nome,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Embarque,Sexo_mulher
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 2117,7.2500,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 1759,71.2833,C,1
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 310128,7.9250,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,11380,53.1000,S,1
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,37345,8.0500,S,0

In [70]:
# Criando uma Coluna embarque
embarque = pd.get_dummies(df['Embarque'], drop_first=True)
embarque.head(7)

   Q  S
0  0  1
1  0  0
2  0  1
3  0  1
4  0  1
5  1  0
6  0  1

In [71]:
# Concatenando Embarque no DataFrame
df = pd.concat([df, embarque], axis=1)
df.head()

,IdPassageiro,Sobreviveu,Classe,Nome,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Embarque,Sexo_mulher,Q,S
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 2117,7.2500,S,0,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 1759,71.2833,C,1,0,0
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 310128,7.9250,S,1,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,11380,53.1000,S,1,0,1
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,37345,8.0500,S,0,0,1

In [72]:
# Removendo a coluna Embarque original
df.drop('Embarque', axis=1, inplace=True)
df.head(7)

,IdPassageiro,Sobreviveu,Classe,Nome,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Sexo_mulher,Q,S
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 2117,7.2500,0,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 1759,71.2833,1,0,0
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 310128,7.9250,1,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,11380,53.1000,1,0,1
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,37345,8.0500,0,0,1
5,6,0,3,"Moran, Mr. James",54.0,0,0,33087,8.4583,0,1,0
6,7,0,1,"McCarthy, Mr. Timothy J",54.0,0,0,1746,51.8625,0,0,1

In [73]:
# Criando uma Coluna com Nome iniciais para os nomes
df['iniciais'] = df['Nome'].str.extract("([a-zA-Z]+)\.")
df['iniciais'].head(7)

0      Mr
1     Mrs
2    Miss
3     Mrs
4      Mr
5      Mr
6      Mr
Name: iniciais, dtype: object

In [75]:
# Tratando Novamente a Coluna Sexo
df['Sexo'] = df['Sexo_mulher'].map({0:'homen', 1:'mulher'})
df['Sexo'].head(7)

0     homen
1    mulher
2    mulher
3    mulher
4     homen
5     homen
6     homen
Name: Sexo, dtype: object

## Engenharia de Recursos

In [76]:
df['iniciais'] = df['iniciais'].apply(lambda x: 'Outros' if x not in ['Master', 'Miss', 'Mr'] else x)
df['iniciais'].head(7)

0        Mr
1    Outros
2      Miss
3    Outros
4        Mr
5        Mr
6        Mr
Name: iniciais, dtype: object

In [77]:
# Tabela cruzada
pd.crosstab(df['iniciais'], df['Sexo'])

Sexo      homen  mulher
iniciais
Master       40       0
Miss          0     182
Mr          517       0
Outros       20     132

In [83]:
# Analisando a Media
df[['iniciais', 'Sexo', 'Idade', 'Classe', 'Sobreviveu']].loc[df['iniciais'] == 'Master'].mean()

C:\Users\franc\AppData\Local\Temp\ipykernel_9984\1528031769.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df[['iniciais', 'Sexo', 'Idade', 'Classe', 'Sobreviveu']].loc[df['iniciais'] == 'Master'].mean()

Idade         7.79175
Classe        2.62500
Sobreviveu    0.57500
dtype: float64

## Mudando Valores Linha Por Linha Usando - Iterrows

In [85]:
# Iremos Utiliza a Coluna Cabine, iremos importa novamente os dataframe
cabine = pd.read_csv('dados/train.csv')
cabine.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [86]:
# Analisando os Dados Nulos de Cabine
cabine.Cabin.isnull().sum()

687

In [87]:
# Analisando o Total de Dados
cabine.shape

(891, 12)

In [88]:
# Iterrows - Iremos pega apenas a 0 linha que refere a 1 linha

for idx, _ in cabine[['Cabin']].dropna().iterrows():
    cabine_individual = cabine['Cabin'].at[idx]
    cabine['Cabin'].at[idx] = cabine_individual[0]
    
cabine.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [89]:
cabine[['Cabin', 'Survived', 'Sex', 'Pclass']].dropna().groupby(['Cabin', 'Sex']).mean()

              Survived    Pclass
Cabin Sex
A     female  1.000000  1.000000
      male    0.428571  1.000000
B     female  1.000000  1.000000
      male    0.400000  1.000000
C     female  0.888889  1.000000
      male    0.343750  1.000000
D     female  1.000000  1.111111
      male    0.466667  1.133333
E     female  0.933333  1.400000
      male    0.588235  1.235294
F     female  1.000000  2.200000
      male    0.375000  2.500000
G     female  0.500000  3.000000
T     male    0.000000  1.000000